zephyrproject-rtos/hal_gigadevice/include/dt-bindings/pinctrl/gd32vf103c(b-8)xx-pinctrl.h
/*
 * Autogenerated file
 *
 * SPDX-License-Identifier: Apache 2.0
 */

#include "gd32vf103xx-afio.h"

/* ADC01_IN0 */
#define ADC01_IN0_PA0 \
	GD32_PINMUX_AFIO('A', 0, ANALOG, NORMP)

/* ADC01_IN1 */
#define ADC01_IN1_PA1 \
	GD32_PINMUX_AFIO('A', 1, ANALOG, NORMP)

/* ADC01_IN2 */
#define ADC01_IN2_PA2 \
	GD32_PINMUX_AFIO('A', 2, ANALOG, NORMP)

/* ADC01_IN3 */
#define ADC01_IN3_PA3 \
	GD32_PINMUX_AFIO('A', 3, ANALOG, NORMP)

/* ADC01_IN4 */
#define ADC01_IN4_PA4 \
	GD32_PINMUX_AFIO('A', 4, ANALOG, NORMP)

/* ADC01_IN5 */
#define ADC01_IN5_PA5 \
	GD32_PINMUX_AFIO('A', 5, ANALOG, NORMP)

/* ADC01_IN6 */
#define ADC01_IN6_PA6 \
	GD32_PINMUX_AFIO('A', 6, ANALOG, NORMP)

/* ADC01_IN7 */
#define ADC01_IN7_PA7 \
	GD32_PINMUX_AFIO('A', 7, ANALOG, NORMP)

/* ADC01_IN8 */
#define ADC01_IN8_PB0 \
	GD32_PINMUX_AFIO('B', 0, ANALOG, NORMP)

/* ADC01_IN9 */
#define ADC01_IN9_PB1 \
	GD32_PINMUX_AFIO('B', 1, ANALOG, NORMP)

/* CAN0_RX */
#define CAN0_RX_PA11_NORMP \
	GD32_PINMUX_AFIO('A', 11, GPIO_IN, CAN0_NORMP)
#define CAN0_RX_PB8_PRMP \
	GD32_PINMUX_AFIO('B', 8, GPIO_IN, CAN0_PRMP)
#define CAN0_RX_PD0_FRMP \
	GD32_PINMUX_AFIO('D', 0, GPIO_IN, CAN0_FRMP)

/* CAN0_TX */
#define CAN0_TX_PA12_NORMP \
	GD32_PINMUX_AFIO('A', 12, ALTERNATE, CAN0_NORMP)
#define CAN0_TX_PB9_PRMP \
	GD32_PINMUX_AFIO('B', 9, ALTERNATE, CAN0_PRMP)
#define CAN0_TX_PD1_FRMP \
	GD32_PINMUX_AFIO('D', 1, ALTERNATE, CAN0_FRMP)

/* CAN1_RX */
#define CAN1_RX_PB12_NORMP \
	GD32_PINMUX_AFIO('B', 12, GPIO_IN, CAN1_NORMP)
#define CAN1_RX_PB5_RMP \
	GD32_PINMUX_AFIO('B', 5, GPIO_IN, CAN1_RMP)

/* CAN1_TX */
#define CAN1_TX_PB13_NORMP \
	GD32_PINMUX_AFIO('B', 13, ALTERNATE, CAN1_NORMP)
#define CAN1_TX_PB6_RMP \
	GD32_PINMUX_AFIO('B', 6, ALTERNATE, CAN1_RMP)

/* CK_OUT0 */
#define CK_OUT0_PA8 \
	GD32_PINMUX_AFIO('A', 8, ALTERNATE, NORMP)

/* DAC_OUT0 */
#define DAC_OUT0_PA4 \
	GD32_PINMUX_AFIO('A', 4, ANALOG, NORMP)

/* DAC_OUT1 */
#define DAC_OUT1_PA5 \
	GD32_PINMUX_AFIO('A', 5, ANALOG, NORMP)

/* EXMC_D2 */
#define EXMC_D2_PD0 \
	GD32_PINMUX_AFIO('D', 0, ALTERNATE, NORMP)

/* EXMC_D3 */
#define EXMC_D3_PD1 \
	GD32_PINMUX_AFIO('D', 1, ALTERNATE, NORMP)

/* I2C0_SCL */
#define I2C0_SCL_PB6_NORMP \
	GD32_PINMUX_AFIO('B', 6, ALTERNATE, I2C0_NORMP)
#define I2C0_SCL_PB8_RMP \
	GD32_PINMUX_AFIO('B', 8, ALTERNATE, I2C0_RMP)

/* I2C0_SDA */
#define I2C0_SDA_PB7_NORMP \
	GD32_PINMUX_AFIO('B', 7, ALTERNATE, I2C0_NORMP)
#define I2C0_SDA_PB9_RMP \
	GD32_PINMUX_AFIO('B', 9, ALTERNATE, I2C0_RMP)

/* I2C0_SMBA */
#define I2C0_SMBA_PB5 \
	GD32_PINMUX_AFIO('B', 5, ALTERNATE, NORMP)

/* I2C1_SCL */
#define I2C1_SCL_PB10 \
	GD32_PINMUX_AFIO('B', 10, ALTERNATE, NORMP)

/* I2C1_SDA */
#define I2C1_SDA_PB11 \
	GD32_PINMUX_AFIO('B', 11, ALTERNATE, NORMP)

/* I2C1_SMBA */
#define I2C1_SMBA_PB12 \
	GD32_PINMUX_AFIO('B', 12, ALTERNATE, NORMP)

/* I2S1_CK */
#define I2S1_CK_PB13_INP \
	GD32_PINMUX_AFIO('B', 13, GPIO_IN, NORMP)
#define I2S1_CK_PB13_OUT \
	GD32_PINMUX_AFIO('B', 13, ALTERNATE, NORMP)

/* I2S1_SD */
#define I2S1_SD_PB15_INP \
	GD32_PINMUX_AFIO('B', 15, GPIO_IN, NORMP)
#define I2S1_SD_PB15_OUT \
	GD32_PINMUX_AFIO('B', 15, ALTERNATE, NORMP)

/* I2S1_WS */
#define I2S1_WS_PB12_INP \
	GD32_PINMUX_AFIO('B', 12, GPIO_IN, NORMP)
#define I2S1_WS_PB12_OUT \
	GD32_PINMUX_AFIO('B', 12, ALTERNATE, NORMP)

/* I2S2_CK */
#define I2S2_CK_PB3_INP_NORMP \
	GD32_PINMUX_AFIO('B', 3, GPIO_IN, I2S2_NORMP)
#define I2S2_CK_PB3_OUT_NORMP \
	GD32_PINMUX_AFIO('B', 3, ALTERNATE, I2S2_NORMP)
#define I2S2_CK_PC10_INP_RMP \
	GD32_PINMUX_AFIO('C', 10, GPIO_IN, I2S2_RMP)
#define I2S2_CK_PC10_OUT_RMP \
	GD32_PINMUX_AFIO('C', 10, ALTERNATE, I2S2_RMP)

/* I2S2_SD */
#define I2S2_SD_PB5_INP_NORMP \
	GD32_PINMUX_AFIO('B', 5, GPIO_IN, I2S2_NORMP)
#define I2S2_SD_PB5_OUT_NORMP \
	GD32_PINMUX_AFIO('B', 5, ALTERNATE, I2S2_NORMP)
#define I2S2_SD_PC12_INP_RMP \
	GD32_PINMUX_AFIO('C', 12, GPIO_IN, I2S2_RMP)
#define I2S2_SD_PC12_OUT_RMP \
	GD32_PINMUX_AFIO('C', 12, ALTERNATE, I2S2_RMP)

/* I2S2_WS */
#define I2S2_WS_PA15_INP_NORMP \
	GD32_PINMUX_AFIO('A', 15, GPIO_IN, I2S2_NORMP)
#define I2S2_WS_PA15_OUT_NORMP \
	GD32_PINMUX_AFIO('A', 15, ALTERNATE, I2S2_NORMP)
#define I2S2_WS_PA4_INP_RMP \
	GD32_PINMUX_AFIO('A', 4, GPIO_IN, I2S2_RMP)
#define I2S2_WS_PA4_OUT_RMP \
	GD32_PINMUX_AFIO('A', 4, ALTERNATE, I2S2_RMP)

/* SPI0_MISO */
#define SPI0_MISO_PA6_INP_NORMP \
	GD32_PINMUX_AFIO('A', 6, GPIO_IN, SPI0_NORMP)
#define SPI0_MISO_PA6_OUT_NORMP \
	GD32_PINMUX_AFIO('A', 6, ALTERNATE, SPI0_NORMP)
#define SPI0_MISO_PB4_INP_RMP \
	GD32_PINMUX_AFIO('B', 4, GPIO_IN, SPI0_RMP)
#define SPI0_MISO_PB4_OUT_RMP \
	GD32_PINMUX_AFIO('B', 4, ALTERNATE, SPI0_RMP)

/* SPI0_MOSI */
#define SPI0_MOSI_PA7_INP_NORMP \
	GD32_PINMUX_AFIO('A', 7, GPIO_IN, SPI0_NORMP)
#define SPI0_MOSI_PA7_OUT_NORMP \
	GD32_PINMUX_AFIO('A', 7, ALTERNATE, SPI0_NORMP)
#define SPI0_MOSI_PB5_INP_RMP \
	GD32_PINMUX_AFIO('B', 5, GPIO_IN, SPI0_RMP)
#define SPI0_MOSI_PB5_OUT_RMP \
	GD32_PINMUX_AFIO('B', 5, ALTERNATE, SPI0_RMP)

/* SPI0_NSS */
#define SPI0_NSS_PA4_INP_NORMP \
	GD32_PINMUX_AFIO('A', 4, GPIO_IN, SPI0_NORMP)
#define SPI0_NSS_PA4_OUT_NORMP \
	GD32_PINMUX_AFIO('A', 4, ALTERNATE, SPI0_NORMP)
#define SPI0_NSS_PA15_INP_RMP \
	GD32_PINMUX_AFIO('A', 15, GPIO_IN, SPI0_RMP)
#define SPI0_NSS_PA15_OUT_RMP \
	GD32_PINMUX_AFIO('A', 15, ALTERNATE, SPI0_RMP)

/* SPI0_SCK */
#define SPI0_SCK_PA5_INP_NORMP \
	GD32_PINMUX_AFIO('A', 5, GPIO_IN, SPI0_NORMP)
#define SPI0_SCK_PA5_OUT_NORMP \
	GD32_PINMUX_AFIO('A', 5, ALTERNATE, SPI0_NORMP)
#define SPI0_SCK_PB3_INP_RMP \
	GD32_PINMUX_AFIO('B', 3, GPIO_IN, SPI0_RMP)
#define SPI0_SCK_PB3_OUT_RMP \
	GD32_PINMUX_AFIO('B', 3, ALTERNATE, SPI0_RMP)

/* SPI1_MISO */
#define SPI1_MISO_PB14_INP \
	GD32_PINMUX_AFIO('B', 14, GPIO_IN, NORMP)
#define SPI1_MISO_PB14_OUT \
	GD32_PINMUX_AFIO('B', 14, ALTERNATE, NORMP)

/* SPI1_MOSI */
#define SPI1_MOSI_PB15_INP \
	GD32_PINMUX_AFIO('B', 15, GPIO_IN, NORMP)
#define SPI1_MOSI_PB15_OUT \
	GD32_PINMUX_AFIO('B', 15, ALTERNATE, NORMP)

/* SPI1_NSS */
#define SPI1_NSS_PB12_INP \
	GD32_PINMUX_AFIO('B', 12, GPIO_IN, NORMP)
#define SPI1_NSS_PB12_OUT \
	GD32_PINMUX_AFIO('B', 12, ALTERNATE, NORMP)

/* SPI1_SCK */
#define SPI1_SCK_PB13_INP \
	GD32_PINMUX_AFIO('B', 13, GPIO_IN, NORMP)
#define SPI1_SCK_PB13_OUT \
	GD32_PINMUX_AFIO('B', 13, ALTERNATE, NORMP)

/* SPI2_MISO */
#define SPI2_MISO_PB4_INP_NORMP \
	GD32_PINMUX_AFIO('B', 4, GPIO_IN, SPI2_NORMP)
#define SPI2_MISO_PB4_OUT_NORMP \
	GD32_PINMUX_AFIO('B', 4, ALTERNATE, SPI2_NORMP)
#define SPI2_MISO_PC11_INP_RMP \
	GD32_PINMUX_AFIO('C', 11, GPIO_IN, SPI2_RMP)
#define SPI2_MISO_PC11_OUT_RMP \
	GD32_PINMUX_AFIO('C', 11, ALTERNATE, SPI2_RMP)

/* SPI2_MOSI */
#define SPI2_MOSI_PB5_INP_NORMP \
	GD32_PINMUX_AFIO('B', 5, GPIO_IN, SPI2_NORMP)
#define SPI2_MOSI_PB5_OUT_NORMP \
	GD32_PINMUX_AFIO('B', 5, ALTERNATE, SPI2_NORMP)
#define SPI2_MOSI_PC12_INP_RMP \
	GD32_PINMUX_AFIO('C', 12, GPIO_IN, SPI2_RMP)
#define SPI2_MOSI_PC12_OUT_RMP \
	GD32_PINMUX_AFIO('C', 12, ALTERNATE, SPI2_RMP)

/* SPI2_NSS */
#define SPI2_NSS_PA15_INP_NORMP \
	GD32_PINMUX_AFIO('A', 15, GPIO_IN, SPI2_NORMP)
#define SPI2_NSS_PA15_OUT_NORMP \
	GD32_PINMUX_AFIO('A', 15, ALTERNATE, SPI2_NORMP)
#define SPI2_NSS_PA4_INP_RMP \
	GD32_PINMUX_AFIO('A', 4, GPIO_IN, SPI2_RMP)
#define SPI2_NSS_PA4_OUT_RMP \
	GD32_PINMUX_AFIO('A', 4, ALTERNATE, SPI2_RMP)

/* SPI2_SCK */
#define SPI2_SCK_PB3_INP_NORMP \
	GD32_PINMUX_AFIO('B', 3, GPIO_IN, SPI2_NORMP)
#define SPI2_SCK_PB3_OUT_NORMP \
	GD32_PINMUX_AFIO('B', 3, ALTERNATE, SPI2_NORMP)
#define SPI2_SCK_PC10_INP_RMP \
	GD32_PINMUX_AFIO('C', 10, GPIO_IN, SPI2_RMP)
#define SPI2_SCK_PC10_OUT_RMP \
	GD32_PINMUX_AFIO('C', 10, ALTERNATE, SPI2_RMP)

/* TAMPER */
#define TAMPER_PC13 \
	GD32_PINMUX_AFIO('C', 13, GPIO_IN, NORMP)

/* TIMER0_BRKIN */
#define TIMER0_BRKIN_PB12 \
	GD32_PINMUX_AFIO('B', 12, GPIO_IN, NORMP)

/* TIMER0_CH0 */
#define TIMER0_CH0_PA8_INP_NORMP \
	GD32_PINMUX_AFIO('A', 8, GPIO_IN, TIMER0_NORMP)
#define TIMER0_CH0_PA8_OUT_NORMP \
	GD32_PINMUX_AFIO('A', 8, ALTERNATE, TIMER0_NORMP)
#define TIMER0_CH0_PA8_INP_PRMP \
	GD32_PINMUX_AFIO('A', 8, GPIO_IN, TIMER0_PRMP)
#define TIMER0_CH0_PA8_OUT_PRMP \
	GD32_PINMUX_AFIO('A', 8, ALTERNATE, TIMER0_PRMP)
#define TIMER0_CH0_PE9_INP_FRMP \
	GD32_PINMUX_AFIO('E', 9, GPIO_IN, TIMER0_FRMP)
#define TIMER0_CH0_PE9_OUT_FRMP \
	GD32_PINMUX_AFIO('E', 9, ALTERNATE, TIMER0_FRMP)

/* TIMER0_CH0_ON */
#define TIMER0_CH0_ON_PB13_NORMP \
	GD32_PINMUX_AFIO('B', 13, ALTERNATE, TIMER0_NORMP)
#define TIMER0_CH0_ON_PA7_PRMP \
	GD32_PINMUX_AFIO('A', 7, ALTERNATE, TIMER0_PRMP)
#define TIMER0_CH0_ON_PE8_FRMP \
	GD32_PINMUX_AFIO('E', 8, ALTERNATE, TIMER0_FRMP)

/* TIMER0_CH1 */
#define TIMER0_CH1_PA9_INP_NORMP \
	GD32_PINMUX_AFIO('A', 9, GPIO_IN, TIMER0_NORMP)
#define TIMER0_CH1_PA9_OUT_NORMP \
	GD32_PINMUX_AFIO('A', 9, ALTERNATE, TIMER0_NORMP)
#define TIMER0_CH1_PA9_INP_PRMP \
	GD32_PINMUX_AFIO('A', 9, GPIO_IN, TIMER0_PRMP)
#define TIMER0_CH1_PA9_OUT_PRMP \
	GD32_PINMUX_AFIO('A', 9, ALTERNATE, TIMER0_PRMP)
#define TIMER0_CH1_PE11_INP_FRMP \
	GD32_PINMUX_AFIO('E', 11, GPIO_IN, TIMER0_FRMP)
#define TIMER0_CH1_PE11_OUT_FRMP \
	GD32_PINMUX_AFIO('E', 11, ALTERNATE, TIMER0_FRMP)

/* TIMER0_CH1_ON */
#define TIMER0_CH1_ON_PB14_NORMP \
	GD32_PINMUX_AFIO('B', 14, ALTERNATE, TIMER0_NORMP)
#define TIMER0_CH1_ON_PB0_PRMP \
	GD32_PINMUX_AFIO('B', 0, ALTERNATE, TIMER0_PRMP)
#define TIMER0_CH1_ON_PE10_FRMP \
	GD32_PINMUX_AFIO('E', 10, ALTERNATE, TIMER0_FRMP)

/* TIMER0_CH2 */
#define TIMER0_CH2_PA10_INP_NORMP \
	GD32_PINMUX_AFIO('A', 10, GPIO_IN, TIMER0_NORMP)
#define TIMER0_CH2_PA10_OUT_NORMP \
	GD32_PINMUX_AFIO('A', 10, ALTERNATE, TIMER0_NORMP)
#define TIMER0_CH2_PA10_INP_PRMP \
	GD32_PINMUX_AFIO('A', 10, GPIO_IN, TIMER0_PRMP)
#define TIMER0_CH2_PA10_OUT_PRMP \
	GD32_PINMUX_AFIO('A', 10, ALTERNATE, TIMER0_PRMP)
#define TIMER0_CH2_PE13_INP_FRMP \
	GD32_PINMUX_AFIO('E', 13, GPIO_IN, TIMER0_FRMP)
#define TIMER0_CH2_PE13_OUT_FRMP \
	GD32_PINMUX_AFIO('E', 13, ALTERNATE, TIMER0_FRMP)

/* TIMER0_CH2_ON */
#define TIMER0_CH2_ON_PB15_NORMP \
	GD32_PINMUX_AFIO('B', 15, ALTERNATE, TIMER0_NORMP)
#define TIMER0_CH2_ON_PB1_PRMP \
	GD32_PINMUX_AFIO('B', 1, ALTERNATE, TIMER0_PRMP)
#define TIMER0_CH2_ON_PE12_FRMP \
	GD32_PINMUX_AFIO('E', 12, ALTERNATE, TIMER0_FRMP)

/* TIMER0_CH3 */
#define TIMER0_CH3_PA11_INP_NORMP \
	GD32_PINMUX_AFIO('A', 11, GPIO_IN, TIMER0_NORMP)
#define TIMER0_CH3_PA11_OUT_NORMP \
	GD32_PINMUX_AFIO('A', 11, ALTERNATE, TIMER0_NORMP)
#define TIMER0_CH3_PA11_INP_PRMP \
	GD32_PINMUX_AFIO('A', 11, GPIO_IN, TIMER0_PRMP)
#define TIMER0_CH3_PA11_OUT_PRMP \
	GD32_PINMUX_AFIO('A', 11, ALTERNATE, TIMER0_PRMP)
#define TIMER0_CH3_PE14_INP_FRMP \
	GD32_PINMUX_AFIO('E', 14, GPIO_IN, TIMER0_FRMP)
#define TIMER0_CH3_PE14_OUT_FRMP \
	GD32_PINMUX_AFIO('E', 14, ALTERNATE, TIMER0_FRMP)

/* TIMER0_ETI */
#define TIMER0_ETI_PA12_NORMP \
	GD32_PINMUX_AFIO('A', 12, GPIO_IN, TIMER0_NORMP)
#define TIMER0_ETI_PA12_PRMP \
	GD32_PINMUX_AFIO('A', 12, GPIO_IN, TIMER0_PRMP)
#define TIMER0_ETI_PE7_FRMP \
	GD32_PINMUX_AFIO('E', 7, GPIO_IN, TIMER0_FRMP)

/* TIMER1_CH0 */
#define TIMER1_CH0_PA0_INP_NORMP \
	GD32_PINMUX_AFIO('A', 0, GPIO_IN, TIMER1_NORMP)
#define TIMER1_CH0_PA0_OUT_NORMP \
	GD32_PINMUX_AFIO('A', 0, ALTERNATE, TIMER1_NORMP)
#define TIMER1_CH0_PA0_INP_PRMP2 \
	GD32_PINMUX_AFIO('A', 0, GPIO_IN, TIMER1_PRMP2)
#define TIMER1_CH0_PA0_OUT_PRMP2 \
	GD32_PINMUX_AFIO('A', 0, ALTERNATE, TIMER1_PRMP2)
#define TIMER1_CH0_PA15_INP_PRMP1 \
	GD32_PINMUX_AFIO('A', 15, GPIO_IN, TIMER1_PRMP1)
#define TIMER1_CH0_PA15_OUT_PRMP1 \
	GD32_PINMUX_AFIO('A', 15, ALTERNATE, TIMER1_PRMP1)
#define TIMER1_CH0_PA15_INP_FRMP \
	GD32_PINMUX_AFIO('A', 15, GPIO_IN, TIMER1_FRMP)
#define TIMER1_CH0_PA15_OUT_FRMP \
	GD32_PINMUX_AFIO('A', 15, ALTERNATE, TIMER1_FRMP)

/* TIMER1_CH1 */
#define TIMER1_CH1_PA1_INP_NORMP \
	GD32_PINMUX_AFIO('A', 1, GPIO_IN, TIMER1_NORMP)
#define TIMER1_CH1_PA1_OUT_NORMP \
	GD32_PINMUX_AFIO('A', 1, ALTERNATE, TIMER1_NORMP)
#define TIMER1_CH1_PA1_INP_PRMP2 \
	GD32_PINMUX_AFIO('A', 1, GPIO_IN, TIMER1_PRMP2)
#define TIMER1_CH1_PA1_OUT_PRMP2 \
	GD32_PINMUX_AFIO('A', 1, ALTERNATE, TIMER1_PRMP2)
#define TIMER1_CH1_PB3_INP_PRMP1 \
	GD32_PINMUX_AFIO('B', 3, GPIO_IN, TIMER1_PRMP1)
#define TIMER1_CH1_PB3_OUT_PRMP1 \
	GD32_PINMUX_AFIO('B', 3, ALTERNATE, TIMER1_PRMP1)
#define TIMER1_CH1_PB3_INP_FRMP \
	GD32_PINMUX_AFIO('B', 3, GPIO_IN, TIMER1_FRMP)
#define TIMER1_CH1_PB3_OUT_FRMP \
	GD32_PINMUX_AFIO('B', 3, ALTERNATE, TIMER1_FRMP)

/* TIMER1_CH2 */
#define TIMER1_CH2_PA2_INP_NORMP \
	GD32_PINMUX_AFIO('A', 2, GPIO_IN, TIMER1_NORMP)
#define TIMER1_CH2_PA2_OUT_NORMP \
	GD32_PINMUX_AFIO('A', 2, ALTERNATE, TIMER1_NORMP)
#define TIMER1_CH2_PA2_INP_PRMP1 \
	GD32_PINMUX_AFIO('A', 2, GPIO_IN, TIMER1_PRMP1)
#define TIMER1_CH2_PA2_OUT_PRMP1 \
	GD32_PINMUX_AFIO('A', 2, ALTERNATE, TIMER1_PRMP1)
#define TIMER1_CH2_PB10_INP_PRMP2 \
	GD32_PINMUX_AFIO('B', 10, GPIO_IN, TIMER1_PRMP2)
#define TIMER1_CH2_PB10_OUT_PRMP2 \
	GD32_PINMUX_AFIO('B', 10, ALTERNATE, TIMER1_PRMP2)
#define TIMER1_CH2_PB10_INP_FRMP \
	GD32_PINMUX_AFIO('B', 10, GPIO_IN, TIMER1_FRMP)
#define TIMER1_CH2_PB10_OUT_FRMP \
	GD32_PINMUX_AFIO('B', 10, ALTERNATE, TIMER1_FRMP)

/* TIMER1_CH3 */
#define TIMER1_CH3_PA3_INP_NORMP \
	GD32_PINMUX_AFIO('A', 3, GPIO_IN, TIMER1_NORMP)
#define TIMER1_CH3_PA3_OUT_NORMP \
	GD32_PINMUX_AFIO('A', 3, ALTERNATE, TIMER1_NORMP)
#define TIMER1_CH3_PA3_INP_PRMP1 \
	GD32_PINMUX_AFIO('A', 3, GPIO_IN, TIMER1_PRMP1)
#define TIMER1_CH3_PA3_OUT_PRMP1 \
	GD32_PINMUX_AFIO('A', 3, ALTERNATE, TIMER1_PRMP1)
#define TIMER1_CH3_PB11_INP_PRMP2 \
	GD32_PINMUX_AFIO('B', 11, GPIO_IN, TIMER1_PRMP2)
#define TIMER1_CH3_PB11_OUT_PRMP2 \
	GD32_PINMUX_AFIO('B', 11, ALTERNATE, TIMER1_PRMP2)
#define TIMER1_CH3_PB11_INP_FRMP \
	GD32_PINMUX_AFIO('B', 11, GPIO_IN, TIMER1_FRMP)
#define TIMER1_CH3_PB11_OUT_FRMP \
	GD32_PINMUX_AFIO('B', 11, ALTERNATE, TIMER1_FRMP)

/* TIMER2_CH0 */
#define TIMER2_CH0_PA6_INP_NORMP \
	GD32_PINMUX_AFIO('A', 6, GPIO_IN, TIMER2_NORMP)
#define TIMER2_CH0_PA6_OUT_NORMP \
	GD32_PINMUX_AFIO('A', 6, ALTERNATE, TIMER2_NORMP)
#define TIMER2_CH0_PB4_INP_PRMP \
	GD32_PINMUX_AFIO('B', 4, GPIO_IN, TIMER2_PRMP)
#define TIMER2_CH0_PB4_OUT_PRMP \
	GD32_PINMUX_AFIO('B', 4, ALTERNATE, TIMER2_PRMP)
#define TIMER2_CH0_PC6_INP_FRMP \
	GD32_PINMUX_AFIO('C', 6, GPIO_IN, TIMER2_FRMP)
#define TIMER2_CH0_PC6_OUT_FRMP \
	GD32_PINMUX_AFIO('C', 6, ALTERNATE, TIMER2_FRMP)

/* TIMER2_CH1 */
#define TIMER2_CH1_PA7_INP_NORMP \
	GD32_PINMUX_AFIO('A', 7, GPIO_IN, TIMER2_NORMP)
#define TIMER2_CH1_PA7_OUT_NORMP \
	GD32_PINMUX_AFIO('A', 7, ALTERNATE, TIMER2_NORMP)
#define TIMER2_CH1_PB5_INP_PRMP \
	GD32_PINMUX_AFIO('B', 5, GPIO_IN, TIMER2_PRMP)
#define TIMER2_CH1_PB5_OUT_PRMP \
	GD32_PINMUX_AFIO('B', 5, ALTERNATE, TIMER2_PRMP)
#define TIMER2_CH1_PC7_INP_FRMP \
	GD32_PINMUX_AFIO('C', 7, GPIO_IN, TIMER2_FRMP)
#define TIMER2_CH1_PC7_OUT_FRMP \
	GD32_PINMUX_AFIO('C', 7, ALTERNATE, TIMER2_FRMP)

/* TIMER2_CH2 */
#define TIMER2_CH2_PB0_INP_NORMP \
	GD32_PINMUX_AFIO('B', 0, GPIO_IN, TIMER2_NORMP)
#define TIMER2_CH2_PB0_OUT_NORMP \
	GD32_PINMUX_AFIO('B', 0, ALTERNATE, TIMER2_NORMP)
#define TIMER2_CH2_PB0_INP_PRMP \
	GD32_PINMUX_AFIO('B', 0, GPIO_IN, TIMER2_PRMP)
#define TIMER2_CH2_PB0_OUT_PRMP \
	GD32_PINMUX_AFIO('B', 0, ALTERNATE, TIMER2_PRMP)
#define TIMER2_CH2_PC8_INP_FRMP \
	GD32_PINMUX_AFIO('C', 8, GPIO_IN, TIMER2_FRMP)
#define TIMER2_CH2_PC8_OUT_FRMP \
	GD32_PINMUX_AFIO('C', 8, ALTERNATE, TIMER2_FRMP)

/* TIMER2_CH3 */
#define TIMER2_CH3_PB1_INP_NORMP \
	GD32_PINMUX_AFIO('B', 1, GPIO_IN, TIMER2_NORMP)
#define TIMER2_CH3_PB1_OUT_NORMP \
	GD32_PINMUX_AFIO('B', 1, ALTERNATE, TIMER2_NORMP)
#define TIMER2_CH3_PB1_INP_PRMP \
	GD32_PINMUX_AFIO('B', 1, GPIO_IN, TIMER2_PRMP)
#define TIMER2_CH3_PB1_OUT_PRMP \
	GD32_PINMUX_AFIO('B', 1, ALTERNATE, TIMER2_PRMP)
#define TIMER2_CH3_PC9_INP_FRMP \
	GD32_PINMUX_AFIO('C', 9, GPIO_IN, TIMER2_FRMP)
#define TIMER2_CH3_PC9_OUT_FRMP \
	GD32_PINMUX_AFIO('C', 9, ALTERNATE, TIMER2_FRMP)

/* TIMER3_CH0 */
#define TIMER3_CH0_PB6_INP_NORMP \
	GD32_PINMUX_AFIO('B', 6, GPIO_IN, TIMER3_NORMP)
#define TIMER3_CH0_PB6_OUT_NORMP \
	GD32_PINMUX_AFIO('B', 6, ALTERNATE, TIMER3_NORMP)
#define TIMER3_CH0_PD12_INP_RMP \
	GD32_PINMUX_AFIO('D', 12, GPIO_IN, TIMER3_RMP)
#define TIMER3_CH0_PD12_OUT_RMP \
	GD32_PINMUX_AFIO('D', 12, ALTERNATE, TIMER3_RMP)

/* TIMER3_CH1 */
#define TIMER3_CH1_PB7_INP_NORMP \
	GD32_PINMUX_AFIO('B', 7, GPIO_IN, TIMER3_NORMP)
#define TIMER3_CH1_PB7_OUT_NORMP \
	GD32_PINMUX_AFIO('B', 7, ALTERNATE, TIMER3_NORMP)
#define TIMER3_CH1_PD13_INP_RMP \
	GD32_PINMUX_AFIO('D', 13, GPIO_IN, TIMER3_RMP)
#define TIMER3_CH1_PD13_OUT_RMP \
	GD32_PINMUX_AFIO('D', 13, ALTERNATE, TIMER3_RMP)

/* TIMER3_CH2 */
#define TIMER3_CH2_PB8_INP_NORMP \
	GD32_PINMUX_AFIO('B', 8, GPIO_IN, TIMER3_NORMP)
#define TIMER3_CH2_PB8_OUT_NORMP \
	GD32_PINMUX_AFIO('B', 8, ALTERNATE, TIMER3_NORMP)
#define TIMER3_CH2_PD14_INP_RMP \
	GD32_PINMUX_AFIO('D', 14, GPIO_IN, TIMER3_RMP)
#define TIMER3_CH2_PD14_OUT_RMP \
	GD32_PINMUX_AFIO('D', 14, ALTERNATE, TIMER3_RMP)

/* TIMER3_CH3 */
#define TIMER3_CH3_PB9_INP_NORMP \
	GD32_PINMUX_AFIO('B', 9, GPIO_IN, TIMER3_NORMP)
#define TIMER3_CH3_PB9_OUT_NORMP \
	GD32_PINMUX_AFIO('B', 9, ALTERNATE, TIMER3_NORMP)
#define TIMER3_CH3_PD15_INP_RMP \
	GD32_PINMUX_AFIO('D', 15, GPIO_IN, TIMER3_RMP)
#define TIMER3_CH3_PD15_OUT_RMP \
	GD32_PINMUX_AFIO('D', 15, ALTERNATE, TIMER3_RMP)

/* TIMER4_CH1 */
#define TIMER4_CH1_PA1_INP \
	GD32_PINMUX_AFIO('A', 1, GPIO_IN, NORMP)
#define TIMER4_CH1_PA1_OUT \
	GD32_PINMUX_AFIO('A', 1, ALTERNATE, NORMP)

/* TIMER4_CH2 */
#define TIMER4_CH2_PA2_INP \
	GD32_PINMUX_AFIO('A', 2, GPIO_IN, NORMP)
#define TIMER4_CH2_PA2_OUT \
	GD32_PINMUX_AFIO('A', 2, ALTERNATE, NORMP)

/* TIMER4_CH3 */
#define TIMER4_CH3_PA3_INP \
	GD32_PINMUX_AFIO('A', 3, GPIO_IN, NORMP)
#define TIMER4_CH3_PA3_OUT \
	GD32_PINMUX_AFIO('A', 3, ALTERNATE, NORMP)

/* USART0_CK */
#define USART0_CK_PA8 \
	GD32_PINMUX_AFIO('A', 8, ALTERNATE, NORMP)

/* USART0_CTS */
#define USART0_CTS_PA11 \
	GD32_PINMUX_AFIO('A', 11, GPIO_IN, NORMP)

/* USART0_RTS */
#define USART0_RTS_PA12 \
	GD32_PINMUX_AFIO('A', 12, ALTERNATE, NORMP)

/* USART0_RX */
#define USART0_RX_PA10_NORMP \
	GD32_PINMUX_AFIO('A', 10, GPIO_IN, USART0_NORMP)
#define USART0_RX_PB7_RMP \
	GD32_PINMUX_AFIO('B', 7, GPIO_IN, USART0_RMP)

/* USART0_TX */
#define USART0_TX_PA9_NORMP \
	GD32_PINMUX_AFIO('A', 9, ALTERNATE, USART0_NORMP)
#define USART0_TX_PB6_RMP \
	GD32_PINMUX_AFIO('B', 6, ALTERNATE, USART0_RMP)

/* USART1_CK */
#define USART1_CK_PA4_NORMP \
	GD32_PINMUX_AFIO('A', 4, ALTERNATE, USART1_NORMP)
#define USART1_CK_PD7_RMP \
	GD32_PINMUX_AFIO('D', 7, ALTERNATE, USART1_RMP)

/* USART1_CTS */
#define USART1_CTS_PA0_NORMP \
	GD32_PINMUX_AFIO('A', 0, GPIO_IN, USART1_NORMP)
#define USART1_CTS_PD3_RMP \
	GD32_PINMUX_AFIO('D', 3, GPIO_IN, USART1_RMP)

/* USART1_RTS */
#define USART1_RTS_PA1_NORMP \
	GD32_PINMUX_AFIO('A', 1, ALTERNATE, USART1_NORMP)
#define USART1_RTS_PD4_RMP \
	GD32_PINMUX_AFIO('D', 4, ALTERNATE, USART1_RMP)

/* USART1_RX */
#define USART1_RX_PA3_NORMP \
	GD32_PINMUX_AFIO('A', 3, GPIO_IN, USART1_NORMP)
#define USART1_RX_PD6_RMP \
	GD32_PINMUX_AFIO('D', 6, GPIO_IN, USART1_RMP)

/* USART1_TX */
#define USART1_TX_PA2_NORMP \
	GD32_PINMUX_AFIO('A', 2, ALTERNATE, USART1_NORMP)
#define USART1_TX_PD5_RMP \
	GD32_PINMUX_AFIO('D', 5, ALTERNATE, USART1_RMP)

/* USART2_CK */
#define USART2_CK_PB12_NORMP \
	GD32_PINMUX_AFIO('B', 12, ALTERNATE, USART2_NORMP)
#define USART2_CK_PC12_PRMP \
	GD32_PINMUX_AFIO('C', 12, ALTERNATE, USART2_PRMP)
#define USART2_CK_PD10_FRMP \
	GD32_PINMUX_AFIO('D', 10, ALTERNATE, USART2_FRMP)

/* USART2_CTS */
#define USART2_CTS_PB13_NORMP \
	GD32_PINMUX_AFIO('B', 13, GPIO_IN, USART2_NORMP)
#define USART2_CTS_PB13_PRMP \
	GD32_PINMUX_AFIO('B', 13, GPIO_IN, USART2_PRMP)
#define USART2_CTS_PD11_FRMP \
	GD32_PINMUX_AFIO('D', 11, GPIO_IN, USART2_FRMP)

/* USART2_RTS */
#define USART2_RTS_PB14_NORMP \
	GD32_PINMUX_AFIO('B', 14, ALTERNATE, USART2_NORMP)
#define USART2_RTS_PB14_PRMP \
	GD32_PINMUX_AFIO('B', 14, ALTERNATE, USART2_PRMP)
#define USART2_RTS_PD12_FRMP \
	GD32_PINMUX_AFIO('D', 12, ALTERNATE, USART2_FRMP)

/* USART2_RX */
#define USART2_RX_PB11_NORMP \
	GD32_PINMUX_AFIO('B', 11, GPIO_IN, USART2_NORMP)
#define USART2_RX_PC11_PRMP \
	GD32_PINMUX_AFIO('C', 11, GPIO_IN, USART2_PRMP)
#define USART2_RX_PD9_FRMP \
	GD32_PINMUX_AFIO('D', 9, GPIO_IN, USART2_FRMP)

/* USART2_TX */
#define USART2_TX_PB10_NORMP \
	GD32_PINMUX_AFIO('B', 10, ALTERNATE, USART2_NORMP)
#define USART2_TX_PC10_PRMP \
	GD32_PINMUX_AFIO('C', 10, ALTERNATE, USART2_PRMP)
#define USART2_TX_PD8_FRMP \
	GD32_PINMUX_AFIO('D', 8, ALTERNATE, USART2_FRMP)

/* USBFS_DM */
#define USBFS_DM_PA11_INP \
	GD32_PINMUX_AFIO('A', 11, GPIO_IN, NORMP)
#define USBFS_DM_PA11_OUT \
	GD32_PINMUX_AFIO('A', 11, ALTERNATE, NORMP)

/* USBFS_ID */
#define USBFS_ID_PA10_INP \
	GD32_PINMUX_AFIO('A', 10, GPIO_IN, NORMP)
#define USBFS_ID_PA10_OUT \
	GD32_PINMUX_AFIO('A', 10, ALTERNATE, NORMP)

/* USBFS_SOF */
#define USBFS_SOF_PA8 \
	GD32_PINMUX_AFIO('A', 8, ALTERNATE, NORMP)

/* USBFS_VBUS */
#define USBFS_VBUS_PA9 \
	GD32_PINMUX_AFIO('A', 9, GPIO_IN, NORMP)

/* WKUP */
#define WKUP_PA0 \
	GD32_PINMUX_AFIO('A', 0, GPIO_IN, NORMP)
